<?php

class Zodiac
{

    /**
     * @return string
     * При вводе в поле даты определяет знак зодиака и выводит картинку знака
     */
    public static function sign ()
    {
        /**
         * В массиве берем только последние дни "Знаков"
         */
        $monthDay = [
            1 => 21 ,
            2 => 20 ,
            3 => 20 ,
            4 => 20 ,
            5 => 20 ,
            6 => 20 ,
            7 => 21 ,
            8 => 22 ,
            9 => 23 ,
            10 => 23 ,
            11 => 23 ,
            12 => 23 ,
        ];

        $sign = [
            "Козерог" ,
            "Водолей" ,
            "Рыбы" ,
            "Овен" ,
            "Телец" ,
            "Близнецы" ,
            "Рак" ,
            "Лев" ,
            "Девы" ,
            "Весы" ,
            "Скорпион" ,
            "Стрелец" ,
        ];


        if ( !empty( $_POST[ 'date' ] ) ) {

            /**
             * Использую регулярное выражение чтобы отделить день и месяц от даты полученной по форме
             */
            $regexp = '/-(\d{2})/';
            $matches = array ();

            if ( preg_match_all ( $regexp , $_POST[ 'date' ] , $matches ) ) {
                $day = intval ( $matches[ 1 ][ 1 ] );
                $month = intval ( $matches[ 1 ][ 0 ] );

                /**
                 * Возвращаем имя знака относительно номера месяца
                 */
                return $day < $monthDay[ $month ] ? $sign[ $month - 1 ] : $sign[ $month % 12 ];

            }
        } else {
            echo 'Введите дату рождения';
        }

    }

}
